info/ems-interactive-p.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2017-03-01 Wed 16:58 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Emacs: Check Interactive Call For Emacspeak</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="raman" />
</head>
<body>
<div id="content">
<h1 class="title">Emacs: Check Interactive Call For Emacspeak</h1>
<div id="outline-container-org6bd7903" class="outline-2">
<h2 id="org6bd7903"><span class="section-number-2">1</span> Background</h2>
<div class="outline-text-2" id="text-1">
<p>
Emacspeak uses advice as the means to speech-enable Emacs.
Emacspeak's <b>advice</b> forms  need to check if the function being
speech-enabled is being called interactively &#x2014; otherwise one would
get a lot of chatter as these functions get called from within elisp
programs, e.g. functions like <span class="underline">forward-sexp</span> or <span class="underline">kill-sexp</span> that play
the  role of both an interactive command, as well as being a convenient
elisp function.
</p>

<p>
Until Emacs 24, the solution used was to write code   that did the
following check:
</p>

<pre class="example">
(when (interactive-p) ...)
</pre>

<p>
In Emacs-24, <span class="underline">interactive-p</span> was made obsolete and replaced with 
</p>
<pre class="example">
(called-interactively-p 'interactive)
</pre>

<p>
Emacspeak initially used the above form to perform the equivalent
check. However, around the same time, Emacs' <b>advice</b> implementation
went through some changes, and there was an attempt to replace
<b>advice.el</b> with <b>nadvice.el</b>.
</p>

<p>
At the end of that round of changes, some problems emerged with the
new <span class="underline">called-interactively-p</span> implementation; specifically, calling
<span class="underline">called-interactively-p</span> within <span class="underline">around</span> advice forms resulted in hard
to debug errors, including one case of infinite recursion  involving
library <b>smie.el</b> when invoked from within <span class="underline">ruby-mode</span>.
</p>

<p>
After studying the problem in depth in 2014, I decided to create  an
Emacspeak-specific implementation of the <span class="underline">is-interactive</span> check.
</p>

<p>
The resulting implementation has worked well for the last 30 months;
this article is here mostly to document how it works, and the reason
for its existence. Note that Emacspeak uses this custom predicate
<b>only</b> within <span class="underline">advice</span> forms. Further, this predicate has been coded
to only work within <span class="underline">advice</span> forms created by <span class="underline">emacspeak</span>. This
constraint can likely be relaxed, but the tighter implementation is
less risky.
</p>
</div>
</div>

<div id="outline-container-org0f5262e" class="outline-2">
<h2 id="org0f5262e"><span class="section-number-2">2</span> Implementation &#x2014;  <span class="underline">ems-interactive-p</span></h2>
<div class="outline-text-2" id="text-2">
</div><div id="outline-container-orga42f7b7" class="outline-3">
<h3 id="orga42f7b7"><span class="section-number-3">2.1</span> Overview</h3>
<div class="outline-text-3" id="text-2-1">
<p>
Within an <span class="underline">advice</span> form defined by Emacspeak, detect if the enclosing
function call is the result of explicit user interaction. Emacspeak
produces auditory feedback only if this predicate returns <span class="underline">t</span>.
</p>

<p>
We first introduce a flag that will be used to record if the enclosing
(containing) function has an Emacspeak-defined advice on it &#x2014; these
are the only cases that our predicate needs to test.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(defvar ems-called-interactively-p nil
  "Flag that records if containing function was called interactively."
</pre>
</div>

<p>
Next, we define a function that checks if interactive calls to a
function should be recorded. We're only interested in functions that
have an <span class="underline">advice</span> form defined by Emacspeak &#x2014; all Emacspeak-defined
advice forms have the name <span class="underline">emacspeak</span> and can therefore be easily idnetified.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(defun ems-record-interactive-p (f)
  "Predicate to test if we need to record interactive calls of
this function. Memoizes result for future use by placing a
property 'emacspeak on the function symbol."
  (cond
   ((not (symbolp f)) nil)
   ((get f 'emacspeak) t) ; already memoized
   ((ad-find-some-advice f 'any  "emacspeak") ; there is an emacspeak advice
    (put f 'emacspeak t)) ; memoize for future and return true
   (t nil)))
</pre>
</div>

<p>
This is a memoized function that remembers earlier invocations by
setting property <span class="underline">emacspeak</span> on the function symbol.
</p>

<p>
All <span class="underline">advice</span> forms created by Emacspeak are named <span class="underline">emacspeak</span>, so we
can test for the presence of such advice forms using the test:
</p>

<pre class="example">
(ad-find-some-advice f 'any  "emacspeak")
</pre>

<p>
If this test returns <span class="underline">T</span>, we memoize the result and return it.
</p>

<p>
Next, we advice function <span class="underline">call-interactively</span> to check if the function
being called interactively is one of the functions that has been
advised by Emacspeak. If so, we record the fact in the previously
declared global flag <span class="underline">ems-called-interactively-p</span>.
</p>


<div class="org-src-container">
<pre class="src src-emacs-lisp">(defadvice call-interactively (around emacspeak  pre act comp)
  "Set emacspeak  interactive flag if there is an Emacspeak advice 
on the function being called."
  (let ((ems-called-interactively-p ems-called-interactively-p)) ; preserve enclosing state
    (when (ems-record-interactive-p (ad-get-arg 0))
      (setq ems-called-interactively-p (ad-get-arg 0)))
    ad-do-it))
</pre>
</div>

<p>
We define an equivalent advice form on function
<span class="underline">funcall-interactively</span> as well. Now, whenever any function that has
been advised by Emacspeak is called interactively, that interactive
call gets recorded in the global flag. In the custom Emacspeak
predicate we define, we check the value of this flag, and if
set, consume it, i.e. unset the flag and return <span class="underline">T</span>.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(defsubst ems-interactive-p ()
  "Check our interactive flag.
Return T if set and we are called from the advice for the current
interactive command. Turn off the flag once used."
  (when ems-called-interactively-p      ; interactive call
    (let ((caller (cl-second (backtrace-frame 1))) ; containing function name
          (caller-advice ; advice wrapper of called interactive function
           (ad-get-advice-info-field ems-called-interactively-p  'advicefunname))
          (result nil))
       ; T if called from our advice
      (setq result (eq caller caller-advice))
      (when result
        (setq ems-called-interactively-p nil) ; turn off now that we used  it
        result))))
</pre>
</div>

<p>
The only fragile part of the above predicate is the call to
<span class="underline">backtrace-frame</span> which we use to discover the name of the enclosing
function. Notice however that this is no more fragile than the current
implementation of <span class="underline">called-interactively-p</span> &#x2014; which also uses
<span class="underline">backtrace-frame</span>; If there are changes in the byte-compiler, this
form may need to be updated. The implementation above has the
advantage of working correctly for Emacspeak's specific use-case.
</p>
</div>
</div>


<div id="outline-container-orgb4c7663" class="outline-3">
<h3 id="orgb4c7663"><span class="section-number-3">2.2</span> Illustrative Example:Interactive Call To <span class="underline">next-line</span></h3>
<div class="outline-text-3" id="text-2-2">
<p>
User presses <span class="underline">C-n</span> or <span class="underline">[down]</span> to move to the next line &#x2014;
this is an interactive call to function <span class="underline">next-line</span>.
Function <span class="underline">next-line</span> is advised by Emacspeak, that advice form contains:
</p>

<pre class="example">
(when (ems-interactive-p) ...)
</pre>

<p>
Here is the exact sequence of steps that causes the above predicate to
return <span class="underline">t</span> in this case.
</p>

<ol class="org-ol">
<li>Pressing <span class="underline">C-n</span> first calls <span class="underline">call-interactively</span> with <span class="underline">next-line</span> as
the function to call.</li>
<li>The advice on <span class="underline">call-interactively</span> first checks
if  <span class="underline">next-line</span> has been advised by Emacspeak &#x2014;
  <span class="underline">(ems-record-interactive-p (ad-get-arg 0))</span> &#x2014; in this example,
  <span class="underline">(ad-get-arg 0)</span> returns <span class="underline">next-line</span>.</li>
<li>Predicate <span class="underline">ems-record-interactive-p</span>  returns <span class="underline">t</span> after setting
<span class="underline">ems-called-interactively-p</span> to the name of the function being
called &#x2014; <span class="underline">next-line</span>.</li>
<li>The advice mechanism now takes over and invokes the various parts
of the advice-onion, this starts with calling the
advice-generated wrapper <span class="underline">ad-Advice-next-line</span>.</li>
<li>Within the defadvice form, we evaluate <span class="underline">(when (ems-interactive-p) &#x2026;)</span></li>
<li>In the call to predicate <span class="underline">ems-interactive-p</span>, we first check that the global flag
<span class="underline">ems-record-interactive-p</span> is set.</li>
<li>First, we bind <span class="underline">caller</span> to the name of the containing function  
 by evaluating   <span class="underline">(backtrace-frame 1)</span> &#x2014; this evaluates to the
advice-generated wrapper function.</li>
<li>Next, we bind <span class="underline">caller-advice</span>  to the  name of the generated advice wrapper  for  the function recorded in <span class="underline">ems-record-interactive-p</span> using the call <span class="underline">(ad-get-advice-info-field ems-called-interactively-p  'advicefunname)</span>.</li>
<li>For the present example, <span class="underline">caller</span> binds to  <span class="underline">ad-Advice-next-line</span>
&#x2014; since that is the function that the advice system calls. This
matches the value bound to <span class="underline">caller-advice</span> which is the precise
test we need to verify that the advice form is being evaluated in
the context of an interactive call to our advised function.</li>
</ol>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Date: 2017-03-01 Wed 00:00</p>
<p class="author">Author: raman</p>
<p class="date">Created: 2017-03-01 Wed 16:58</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
